[
  {
    "reportId": 1,
    "review": {
      "movieTitle": "Joker",
      "user": "TVpotatoCat",
      "rating": 7.0,
      "usefulVotes": 1257,
      "totalVotes": 1822,
      "title": "I would not call it a masterpiece as some did",
      "body": "There is no doubt that the movie was well thought of - from the plot to execution. I must praise Phoenix's superb acting. He managed to portray very believably the awkward social reject and also the crazy murderer that he became. I really think it's a role only few could do. It was also very interesting to watch how he deteriorated mentally and little by little gave up on trying to fit into society. Gotta hand it to the script writer - the plot was unpredictable.But...There wasn't anything too complex about Arthur's mental state. No deep psychological analysis, or a web of many deep factors that created a one of a kind psychotic maniac. Could it be that I was expecting too much? Very possible since I came with very high expectations after reading some reviews.\nWhat doesn't have anything with expectations is that at the end he didn't remind much of the original Joker. He felt more like a simply society reject that went completely crazy and started killing people. Not that much different from many other serial killers or mass murderers. He didn't have the master mind that so much designated the Joker and made him different from a simple murderer.\nAnother thing is that there were long parts of the movie that felt very dull.\nAlso I found it hard to buy the reason behind the riots in the city and the role the Joker played in them. Even if taken into account that the poverty and anger was cooking for a long time in that society, it still feels somewhat absurd that killing three people in the subway made the joker so notorious.\nIn conclusion, I can identify with the character which gave me a lasting impression of the movie, and this movie could have been very great if it was a movie about how a person that's rejected by society turns slowly into a serial killer. But as a movie about the Joker I felt it was lacking. Lacking the things that made the Joker actually the Joker, and not just another crazy murderer.",
      "reportCount": 1
    },
    "reportedBy": "Alice",
    "status": "confirmed",
    "dateReported": "2025-11-15T22:43:55.018852",
    "reasonType": "uhh",
    "reason": "ugh",
    "handledByAdmin": "admin1",
    "handledAt": "2025-11-15T22:50:57.830343",
    "banDurationSeconds": 259200
  }
]