[
  {
    "reportId": 1,
    "review": {
      "movieTitle": "Joker",
      "user": "TVpotatoCat",
      "rating": 7.0,
      "usefulVotes": 1257,
      "totalVotes": 1822,
      "title": "I would not call it a masterpiece as some did",
      "body": "There is no doubt that the movie was well thought of - from the plot to execution. I must praise Phoenix's superb acting. He managed to portray very believably the awkward social reject and also the crazy murderer that he became. I really think it's a role only few could do. It was also very interesting to watch how he deteriorated mentally and little by little gave up on trying to fit into society. Gotta hand it to the script writer - the plot was unpredictable.But...There wasn't anything too complex about Arthur's mental state. No deep psychological analysis, or a web of many deep factors that created a one of a kind psychotic maniac. Could it be that I was expecting too much? Very possible since I came with very high expectations after reading some reviews.\nWhat doesn't have anything with expectations is that at the end he didn't remind much of the original Joker. He felt more like a simply society reject that went completely crazy and started killing people. Not that much different from many other serial killers or mass murderers. He didn't have the master mind that so much designated the Joker and made him different from a simple murderer.\nAnother thing is that there were long parts of the movie that felt very dull.\nAlso I found it hard to buy the reason behind the riots in the city and the role the Joker played in them. Even if taken into account that the poverty and anger was cooking for a long time in that society, it still feels somewhat absurd that killing three people in the subway made the joker so notorious.\nIn conclusion, I can identify with the character which gave me a lasting impression of the movie, and this movie could have been very great if it was a movie about how a person that's rejected by society turns slowly into a serial killer. But as a movie about the Joker I felt it was lacking. Lacking the things that made the Joker actually the Joker, and not just another crazy murderer.",
      "reportCount": 1
    },
    "reportedBy": "Alice",
    "status": "confirmed",
    "dateReported": "2025-11-15T22:43:55.018852",
    "reasonType": "uhh",
    "reason": "ugh",
    "handledByAdmin": "admin1",
    "handledAt": "2025-11-15T22:50:57.830343",
    "banDurationSeconds": 259200
  },
  {
    "reportId": 2,
    "review": {
      "movieTitle": "Avengers Endgame",
      "user": "jtindahouse",
      "rating": 4.0,
      "usefulVotes": 75,
      "totalVotes": 127,
      "title": "Time travel is such a lazy way to write stories",
      "body": "Only a month or so back I was talking to a friend about how much I hate it when serious movies use time travel to get their characters out of problems. I have no problem with movies like 'Back to the Future' or 'Hot Tub Time Machine' that are both comedy based and use the time machine as a plot for the movie as opposed to a solution for characters problems. When a serious movie uses it though it as lazy as writing as dream sequence in my opinion.At the end of the day though that just underlines the problem with these movies. The heroes are far too powerful. Whatever power they need they simply possess conveniently. Heck, 'Dr Strange' can even see into the future to know exactly what to do to make sure everything turns out alright. If that isn't the stupidest thing I've ever seen in a movie I don't know what is.I felt like the movie went very much as expected as well. Sure some characters die, however they were pretty much telegraphed to do so long before the movie came out. There also seemed to be a lack of conflict as key moments. A lot of things went far too smoothly for my liking in terms of the plan. Finally, the ending with 'Iron Man' simply pulling the glove off 'Thanos' - what the hell was that? Was that supposed to be clever writing? 'Thanos' just standing there for an eternity doing nothing waiting for someone to stop him?A lot of the jokes failed to land too. This was a surprisingly unfunny movie. In a 3 hour movie I got maybe 3 light chuckles out of the film. Every joke just felt so forced and some of the characters who don't have a comedy background delivered them very poorly. 'Avengers: Endgame' is three hours of my life I would like back.",
      "reportCount": 1
    },
    "reportedBy": "testuser",
    "status": "pending",
    "dateReported": "2025-11-30T03:58:39.258888",
    "reasonType": "abusive",
    "reason": null,
    "handledByAdmin": null,
    "handledAt": null,
    "banDurationSeconds": null
  },
  {
    "reportId": 3,
    "review": {
      "movieTitle": "TestMovie1",
      "user": "testuser",
      "rating": 10.0,
      "usefulVotes": 0,
      "totalVotes": 0,
      "title": "Great",
      "body": "string",
      "reportCount": 1
    },
    "reportedBy": "testuser",
    "status": "confirmed",
    "dateReported": "2025-11-30T03:59:02.840535",
    "reasonType": "other",
    "reason": "False informtion",
    "handledByAdmin": "admin1",
    "handledAt": "2025-11-30T18:43:09.891773",
    "banDurationSeconds": 259200
  }
]